package com.ecb.tamochu.neet1programming.exam;

public class Exam4 {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		// TODO 配列の操作Caesar暗号
		// 以下の文字列はシーザー暗号である
		// 使われる文字は「abcdefghijklmnopqrstuvwxyz .,-」である
		// 文字中に「person」が含まれることが分かっている
		// 暗号を解読せよ
		char[] angou = {'q','d','q','-','g','i','.','q','-','a',' ','z','i','a','t','m','x','x','i','t','m','d','q','i','b','t','q','i','-','u','s','t','b','i',' ','r','i','.','q','m','o','q','r','c','x','i','.','q','b','u','b','u',' ','z','i','r',' ','-','i','b','t','q','i','-','q','p','-','q','a','a','i',' ','r','i','p','m','y','m','s','q','k','i','r',' ','-','i','b','t','q','i','-','q','y',' ','d','m','x','i',' ','r','i','.','c','n','x','u','o','i',' ','r','r','u','o','u','m','x','a','k','i','r',' ','-','i','b','t','q','i','q','z','m','o','b','y','q','z','b','k','i','i','-','q','.','q','m','x','i',' ','-','i','m','y','q','z','p','y','q','z','b','i',' ','r','i','x','m','e','a','k','i',' ','-','p','u','z','m','z','o','q','a','i',' ','-','i','-','q','s','c','x','m','b','u',' ','z','a','i','m','z','p','i','r',' ','-','i',' ','b','t','q','-','i','y','m','b','b','q','-','a',';','i','z',' ','-','i','a','t','m','x','x','i','m','z','g','i','.','q','-','a',' ','z','i','n','q','i','u','z','i','m','z','g','i','e','m','g','i','p','u','a','o','-','u','y','u','z','m','b','q','p','i','m','s','m','u','z','a','b','i','r',' ','-','i','a','.',' ','z','a',' ','-','u','z','s','i','a','c','o','t','i','i','m','i','.','q','b','u','b','u',' ','z','j'};

	}

}
